In [97]:
import pandas as pd
import numpy as np

# HR Dataset

In [98]:
df=pd.read_csv("/home/ubuntu/Ranjeet/DSBDAL/HR-Employee-Attrition.csv")

In [99]:
df.head(5)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2

## Mean of monthly income and age

In [100]:
print("The mean of monthly income is :",df.loc[:,"MonthlyIncome"].mean())
print("The mean of age is :",df.loc[:,"Age"].mean())

The mean of monthly income is : 6502.931292517007
The mean of age is : 36.923809523809524

## Mode of monthly income and age

In [101]:
print("The median of monthly income is :",df.loc[:,"MonthlyIncome"].median())
print("The median of age is :",df.loc[:,"Age"].median())

The median of monthly income is : 4919.0
The median of age is : 36.0

## Median of monthly income and age

In [102]:
print("The mode of monthly income is :",df.loc[:,"MonthlyIncome"].mode())
print("The mode of age is :",df.loc[:,"Age"].mode())

The mode of monthly income is : 0    2342
Name: MonthlyIncome, dtype: int64
The mode of age is : 0    35
Name: Age, dtype: int64

## Standard deviation of monthly income and age

In [103]:
print("The standard deviation of monthly income is :",df.loc[:,"MonthlyIncome"].std())
print("The standard deviation of age is :",df.loc[:,"Age"].std())

The standard deviation of monthly income is : 4707.956783097994
The standard deviation of age is : 9.135373489136732

## Storing age and monthly income in array and then finding maximum and minimum values

In [104]:
array1 = np.array(df['MonthlyIncome'])
array2=np.array(df["Age"])
print("Income",array1)
print("Age array",array2)
print("Maximum income among the employees is :",max(array1))
print("Minimum income among the employees is :",min(array1))
print("Maximum age among the employees is :",max(array2))
print("Minimum age among the employees is :",min(array2))

Income [5993 5130 2090 ... 6142 5390 4404]
Age array [41 49 37 ... 27 49 34]
Maximum income among the employees is : 19999
Minimum income among the employees is : 1009
Maximum age among the employees is : 60
Minimum age among the employees is : 18

## Replacing the categorical values by numeric values

In [105]:
df.head(1)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5

In [115]:
df1=df
df1["BusinessTravel"].replace({"Travel_Rarely":1, "Travel_Frequently":0}, inplace=True)
df1["Attrition"].replace({ "Yes":1, "No":0}, inplace=True)
df1.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,1,1,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,0,0,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,1,1,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,0,0,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,0,1,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2

# Iris Dataset

In [116]:
data=pd.read_csv("/home/ubuntu/Ranjeet/DSBDAL/iris.csv")

In [117]:
data.head(5)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [118]:
data.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

## Mean of sepal length and petal length

In [119]:
print("The mean of sepal length is :",data.loc[:,"sepal_length"].mean())
print("The mean of petal length is :",data.loc[:,"petal_length"].mean())

The mean of sepal length is : 5.843333333333334
The mean of petal length is : 3.758666666666666

## Median of sepal length and petal length

In [120]:
print("The median of sepal length is :",data.loc[:,"sepal_length"].median())
print("The median of petal length is :",data.loc[:,"petal_length"].median())

The median of sepal length is : 5.8
The median of petal length is : 4.35

## Mode of sepal length and petal length

In [121]:
print("The mode of sepal length is :",data.loc[:,"sepal_length"].mode())
print("The mode of petal length is :",data.loc[:,"petal_length"].mode())

The mode of sepal length is : 0    5.0
Name: sepal_length, dtype: float64
The mode of petal length is : 0    1.5
Name: petal_length, dtype: float64

## Standard deviation sepal length and petal length

In [122]:
print("The standard deviation of sepal length is :",data.loc[:,"sepal_length"].std())
print("The standard deviation of petal length is :",data.loc[:,"petal_length"].std())

The standard deviation of sepal length is : 0.828066127977863
The standard deviation of petal length is : 1.7644204199522626

## Max and Min of sepal length and petal length

In [123]:
array1 = np.array(data['sepal_length'])
array2=np.array(data["petal_length"])
print("Maximum sepal length is :",max(array1))
print("Minimum sepal length is :",min(array1))
print("Maximum petal length is :",max(array2))
print("Minimum petal length is :",min(array2))

Maximum sepal length is : 7.9
Minimum sepal length is : 4.3
Maximum petal length is : 6.9
Minimum petal length is : 1.0